// /* ------------ 1 ------------ */
// if ('0') {
//     alert('Hi!');
// }

// //Строка не пустая - преобразуется в true


// /* ------------ 2 ------------ */

// let message = prompt('Какое официальное название JavaScript?', '');

// if (message == 'ECMAScript') {
//     alert('Верно!');
// } else {
//     alert('Не знаете? ECMAScript!');
// }

// /* ------------ 3 ------------ */

// let numberValue = prompt('Напишите число', 0);

// if (numberValue > 0) {
//     alert(1);
// } else if (numberValue < 0) {
//     alert(-1);
// } else {
//     alert (0);
// }

// /* ------------ 4 ------------ */

// let result = (a + b < 4) ? 'Мало' : 'Много';

// /* ------------ 5 ------------ */

// let message = (login == 'Сотрудник') ? 'Привет' :
//     (login == 'Директор') ? 'Здравствуйте' :
//     (login == '') ? 'Нет логина' :
//     '';

    

